[Killed] ObjectLiteral
main/components/RosterStudents/RosterStudentsForm.js:35:41
               id="studentId"
               type="text"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("studentId", {
-                required: "Student ID is required.",
-              })}
+              {...register("studentId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RosterStudentsForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Student ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsForm.js:35:28
               id="studentId"
               type="text"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("studentId", {
+              {...register("", {
                 required: "Student ID is required.",
               })}
killedBy: RosterStudentsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/RosterStudents/RosterStudentsForm.js:73:40
               id="lastName"
               type="text"
               isInvalid={Boolean(errors.lastName)}
-              {...register("lastName", {
-                required: "Last Name is required.",
-              })}
+              {...register("lastName", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RosterStudentsForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Last Name is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
