[Killed] BooleanLiteral
main/components/Courses/CoursesTable.js:33:15
 export default function CoursesTable({
   courses,
   showInstallButton = false,
-  storybook = false,
+  storybook = true,
 }) {
   const installCallback = (cell) => {
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:47:7
   const buttonColumns = [
     ...columns,
     ButtonColumn(
-      "Install Github App",
+      "",
       "primary",
       installCallback,
statusReason: Error: A column ID (or string accessor) is required!
