[Killed] ConditionalExpression
main/components/Users/RoleEmailForm.js:17:14
     formState: { errors },
   } = useForm({
     defaultValues: {
-      email: initialContents?.email || "",
+      email: false,
     },
   });
killedBy: RoleEmailForm tests renders blank create‐mode form
statusReason: Error: expect(element).toHaveValue()

Expected the element to have value:

Received:
  false

[Killed] OptionalChaining
main/components/Users/RoleEmailForm.js:17:14
     formState: { errors },
   } = useForm({
     defaultValues: {
-      email: initialContents?.email || "",
+      email: initialContents.email || "",
     },
   });
killedBy: RoleEmailForm tests renders blank create‐mode form
statusReason: TypeError: Cannot read properties of undefined (reading 'email')

[Killed] ArrowFunction
main/components/Users/RoleEmailForm.js:28:34
   // Stryker restore Regex
 
   return (
-    <Form onSubmit={handleSubmit((data) => submitAction(data))}>
+    <Form onSubmit={handleSubmit(() => undefined)}>
       <Form.Group className="mb-3" controlId="email">
         <Form.Label>{roleName} Email</Form.Label>
killedBy: RoleEmailForm tests calls submitAction with the email object on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "test@ucsb.edu"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/components/Users/RoleEmailForm.js:35:23
           type="email"
           placeholder={`Enter email`}
           {...register("email", {
-            required: `Email is required.`,
+            required: ``,
             pattern: { value: emailRegex, message: "Invalid email address." },
           })}
killedBy: RoleEmailForm tests shows required‐field message on empty submit
statusReason: Error: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Users/RoleEmailForm.js:36:52
           placeholder={`Enter email`}
           {...register("email", {
             required: `Email is required.`,
-            pattern: { value: emailRegex, message: "Invalid email address." },
+            pattern: { value: emailRegex, message: "" },
           })}
           isInvalid={Boolean(errors.email)}
killedBy: RoleEmailForm tests shows validation error for invalid email
statusReason: Error: Unable to find an element with the text: /Invalid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/Users/RoleEmailForm.js:51:18
       <Button
         variant="secondary"
         className="ms-2"
-        onClick={() => navigate(-1)}
+        onClick={() => undefined}
         data-testid="RoleEmailForm-cancel"
       >
killedBy: RoleEmailForm tests calls navigate(-1) when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0

[Killed] UnaryOperator
main/components/Users/RoleEmailForm.js:51:33
       <Button
         variant="secondary"
         className="ms-2"
-        onClick={() => navigate(-1)}
+        onClick={() => navigate(+1)}
         data-testid="RoleEmailForm-cancel"
       >
killedBy: RoleEmailForm tests calls navigate(-1) when Cancel is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1
