[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsTable.js:10:15
   },
   {
     Header: "First Name",
-    accessor: "firstName",
+    accessor: "",
   },
   {
killedBy: RosterStudentsTable tests renders expected field data for all rows
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-firstName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsTable.js:22:15
   },
   {
     Header: " GitHub Username",
-    accessor: "githubLogin",
+    accessor: "",
   },
   {
killedBy: RosterStudentsTable tests renders expected field data for all rows
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-githubLogin"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RosterStudents/RosterStudentsTable.js:24:3
     Header: " GitHub Username",
     accessor: "githubLogin",
   },
-  {
-    Header: "GitHub ID",
-    accessor: "githubId",
-  },
+  {},
 ];
 
killedBy: RosterStudentsTable tests renders correct column headers
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsTable.js:26:15
   },
   {
     Header: "GitHub ID",
-    accessor: "githubId",
+    accessor: "",
   },
 ];
killedBy: RosterStudentsTable tests renders expected field data for all rows
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-githubId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BooleanLiteral
main/components/RosterStudents/RosterStudentsTable.js:33:15
 export default function RosterStudentTable({
   rosterStudents,
   showButtons = false,
-  storybook = false,
+  storybook = true,
 }) {
   const editCallback = (cell) => {
killedBy: RosterStudentsTable tests edit/delete fallback when storybook is omitted (default false)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Edit clicked for row with id: 1"

Number of calls: 0

[Killed] BlockStatement
main/components/RosterStudents/RosterStudentsTable.js:35:34
   showButtons = false,
   storybook = false,
 }) {
-  const editCallback = (cell) => {
-    const id = cell.row.values.id;
-    const msg = `Edit clicked for row with id: ${id}`;
-    if (storybook) {
-      window.alert(msg);
-    } else {
-      console.log(msg);
-    }
-  };
+  const editCallback = (cell) => {};
 
   const deleteCallback = (cell) => {
killedBy: RosterStudentsTable tests shows Edit/Delete buttons and triggers alerts in storybook mode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/RosterStudents/RosterStudentsTable.js:38:9
   const editCallback = (cell) => {
     const id = cell.row.values.id;
     const msg = `Edit clicked for row with id: ${id}`;
-    if (storybook) {
+    if (true) {
       window.alert(msg);
     } else {
killedBy: RosterStudentsTable tests Edit/Delete use console.log when not in storybook
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Edit clicked for row with id: 1"
Received: "Delete clicked for row with id: 1"

Number of calls: 1

[Killed] BlockStatement
main/components/RosterStudents/RosterStudentsTable.js:38:20
   const editCallback = (cell) => {
     const id = cell.row.values.id;
     const msg = `Edit clicked for row with id: ${id}`;
-    if (storybook) {
-      window.alert(msg);
-    } else {
+    if (storybook) {} else {
       console.log(msg);
     }
killedBy: RosterStudentsTable tests shows Edit/Delete buttons and triggers alerts in storybook mode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/RosterStudents/RosterStudentsTable.js:40:12
     const msg = `Edit clicked for row with id: ${id}`;
     if (storybook) {
       window.alert(msg);
-    } else {
-      console.log(msg);
-    }
+    } else {}
   };
 
killedBy: RosterStudentsTable tests Edit/Delete use console.log when not in storybook
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Edit clicked for row with id: 1"
Received: "Delete clicked for row with id: 1"

Number of calls: 1

[Killed] BlockStatement
main/components/RosterStudents/RosterStudentsTable.js:45:36
     }
   };
 
-  const deleteCallback = (cell) => {
-    const id = cell.row.values.id;
-    const msg = `Delete clicked for row with id: ${id}`;
-    if (storybook) {
-      window.alert(msg);
-    } else {
-      console.log(msg);
-    }
-  };
+  const deleteCallback = (cell) => {};
 
   const columnsToDisplay = showButtons
killedBy: RosterStudentsTable tests shows Edit/Delete buttons and triggers alerts in storybook mode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/RosterStudents/RosterStudentsTable.js:48:9
   const deleteCallback = (cell) => {
     const id = cell.row.values.id;
     const msg = `Delete clicked for row with id: ${id}`;
-    if (storybook) {
+    if (true) {
       window.alert(msg);
     } else {
killedBy: RosterStudentsTable tests Edit/Delete use console.log when not in storybook
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Delete clicked for row with id: 1"
Received: "Edit clicked for row with id: 1"

Number of calls: 1

[Killed] BlockStatement
main/components/RosterStudents/RosterStudentsTable.js:48:20
   const deleteCallback = (cell) => {
     const id = cell.row.values.id;
     const msg = `Delete clicked for row with id: ${id}`;
-    if (storybook) {
-      window.alert(msg);
-    } else {
+    if (storybook) {} else {
       console.log(msg);
     }
killedBy: RosterStudentsTable tests shows Edit/Delete buttons and triggers alerts in storybook mode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 1

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/components/RosterStudents/RosterStudentsTable.js:56:7
   };
 
   const columnsToDisplay = showButtons
-    ? [
-        ...columns,
-        ButtonColumn("Edit", "primary", editCallback, "RosterStudentsTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RosterStudentsTable"),
-      ]
+    ? []
     : columns;
 
killedBy: RosterStudentsTable tests shows Edit/Delete buttons and triggers alerts in storybook mode
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsTable.js:58:22
   const columnsToDisplay = showButtons
     ? [
         ...columns,
-        ButtonColumn("Edit", "primary", editCallback, "RosterStudentsTable"),
+        ButtonColumn("", "primary", editCallback, "RosterStudentsTable"),
         ButtonColumn("Delete", "danger", deleteCallback, "RosterStudentsTable"),
       ]
killedBy: RosterStudentsTable tests shows Edit/Delete buttons and triggers alerts in storybook mode
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RosterStudents/RosterStudentsTable.js:59:58
     ? [
         ...columns,
         ButtonColumn("Edit", "primary", editCallback, "RosterStudentsTable"),
-        ButtonColumn("Delete", "danger", deleteCallback, "RosterStudentsTable"),
+        ButtonColumn("Delete", "danger", deleteCallback, ""),
       ]
     : columns;
killedBy: RosterStudentsTable tests shows Edit/Delete buttons and triggers alerts in storybook mode
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RosterStudentsTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
